app/Http/Controllers/CategoryController.php

    public static function index()
    {
        $categories = Category::all();
---
select * from `categories`

    public function update(Category $category, CategoryUpdateRequest $request)
    {
        $request->validated();
        $data = request(['title', 'description']);

        Category::where('id', $category['id'])
            ->update([
                'title' => $data['title'],
                'description' => $data['description']
            ]);
---
update `categories` set `title` = 'Screen for test', `description` = 'Computer screen for test', `categories`.`updated_at` = '2021-02-10 13:22:11' where `id` = 2

    public function delete(Category $category)
    {
        DB::table('categories')->where('id', '=', $category['id'])
            ->delete();
---
delete from `categories` where `id` = 7